import numpy as np
import time


dict_ru = {'Положительные': ['Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да',
                          'Можешь быть уверен в этом'],
        'Нерешительно положительные': ['Мне кажется — «да»', 'Вероятнее всего', 'Хорошие перспективы',
                                       'Знаки говорят — «да»', 'Да'],
        'Нейтральные': ['Пока не ясно, попробуй снова', 'Спроси позже', 'Лучше не рассказывать',
                        'Сейчас нельзя предсказать', 'Сконцентрируйся и спроси опять'],
        'Отрицательные': ['Даже не думай', 'Мой ответ — «нет»', 'По моим данным — «нет»',
                          'Перспективы не очень хорошие', 'Весьма сомнительно']}
key_ru = ['Положительные', 'Нерешительно положительные', 'Нейтральные', 'Отрицательные']
number_key = np.random.randint(0, len(key_ru))
number_key_dict = np.random.randint(0, len(dict_ru[key_ru[number_key]]))
print('Шар восьмерка, задай вопрос и получи ответ.')
time.sleep(5)
print(f'Ответ на твой вопрос: {dict_ru[key_ru[number_key]][number_key_dict]}')
